Configuration/2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sedFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         150;

deltaT          2e-5;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable on;

adjustTimeStep  true;

maxCo           0.3;

maxAlphaCo      0.3;

maxDeltaT       2e-4;

libs (
"libgroovyBC.so"
"libgroovyStandardBCs.so"
     );

functions 
{  
	Multiply
	{
	type            multiply;
	libs            (fieldFunctionObjects);
	fields          (alpha.a U.a);
	result          alphaUa;
	executeControl  timeStep;
	writeControl    writeTime;
	}
	fieldAverage
    	{
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        restartOnrestart false;
	periodicRestart     true;
    	restartPeriod       1;
        fields
	(
	    U.a
            {
               mean         on;
               prime2Mean   on;
               base         time;
            }
	    alpha.a
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
	    alphaUa
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
	}
}

// ************************************************************************* //
